In [12]:
%matplotlib inline

import pandas as pd

In [13]:
df = pd.read_csv(r'C:\Users\hayong\Downloads\silicon_valley_details.csv', index_col=0)

In [14]:
df

         year                race gender          job_category  count
company
23andMe  2016  Hispanic_or_Latino   male            Executives      0
23andMe  2016  Hispanic_or_Latino   male              Managers      1
23andMe  2016  Hispanic_or_Latino   male         Professionals      7
23andMe  2016  Hispanic_or_Latino   male           Technicians      0
23andMe  2016  Hispanic_or_Latino   male         Sales workers      0
...       ...                 ...    ...                   ...    ...
Sanmina  2016      Overall_totals    NaN  laborers and helpers      4
Sanmina  2016      Overall_totals    NaN       Service workers     57
Sanmina  2016      Overall_totals    NaN                Totals   5205
Sanmina  2016      Overall_totals    NaN       Previous_totals   5615
Sanmina  2016      Overall_totals    NaN              Managers    591

[4440 rows x 5 columns]